def print_array(lst):
    """
    Задача 6. Написать функцию, которая принимает на вход список списков (матрицу)
    и выводит ее в виде матрицы (один ряд на одной строке) в консоль
    """
    for row in lst:
        print(row)